#+TITLE: My notes on Data Structures and Algorithms
*** Code
Below is an implementation of a singly-linked list. A double-linked list uses the same concepts, so it isn't included.

#+begin_src python :results output
  class Node:
      def __init__(self, val=None, next_node=None, prev_node=None):
          """Note, this defintintion of a node covers both single and double linking"""
          self.val = val
          self.next_node = next_node
          self.prev_node = prev_node

  class SinglyLinkedList:
      def __init__(self):
          # head --> values ... --> tail
          self.head = None
          self.tail = None

      def append(self, val):
          if self.head is None:   # Case where linked list is empty, so it needs to set both head/tail
              self.tail = self.head = Node(val)  
          else:
              self.tail.next_node = Node(val) # Points current tail's next node to new instance of Node
              self.tail = self.tail.next_node # Sets new tail to be the newly created Node
          return self.tail

      def prepend(self, val):
          if self.head is None:   # Case where linked list is empty, so it needs to set both head/tail
              self.tail = self.head = Node(val)  
          else:
              current_head = self.head # Gets the old head and saves it temporarily
              self.head = Node(val, next_node=current_head) # Creates new node with next node point to old head

      def search(self, val) -> bool:
          curr = self.head
          while curr:
              if curr.val == val:
                  return True
              curr = curr.next_node
          return False

      def insert(self, val, target_idx):
          if target_idx > self.__len__()-1:
              return

          curr = self.head
          idx_count = 0
          while curr:
              if idx_count == target_idx - 1:
                  new_node = Node(val) # Instantiates new node
                  new_node.next_node = curr.next_node # sets new node next to remaining linked list, relative to current node
                  curr.next_node = new_node           # sets current nodes next node to new node (which has rest of list)
                  return

              idx_count += 1
              curr = curr.next_node

      def delete(self, val):
          prev = self.head        # Will always trail one behind
          curr = self.head.next_node  

          while curr:
              if curr.val == val:
                  prev.next_node = curr.next_node
                  return 

              prev = prev.next_node
              curr = curr.next_node

      def print_values(self):     # Basically traversal
          curr = self.head
          while curr:
              print(curr.val, end=" ")
              curr = curr.next_node
          print()

      def __len__(self):
          count = 0
          curr = self.head
          while curr:
              count += 1
              curr = curr.next_node
          return count

  if __name__ == "__main__":
      singly_linked_list = SinglyLinkedList()

      print("Appending 1 and 3 to empty linked list:", end=" ") 
      singly_linked_list.append(1)
      singly_linked_list.append(3)
      singly_linked_list.print_values()

      print("Prepending 0 to existing linked list:", end=" ") 
      singly_linked_list.prepend(0)
      singly_linked_list.print_values()

      print("Len of singly linked list:", singly_linked_list.__len__())

      print("Inserting val=2 to second 'idx':", end=" ")
      singly_linked_list.insert(val=2, target_idx=2)
      singly_linked_list.print_values()
      print("Len of singly linked list:", singly_linked_list.__len__())

      print("Deleting 1 from linked list:", end=" ")
      singly_linked_list.delete(1)
      singly_linked_list.print_values()
      print("Len of singly linked list:", singly_linked_list.__len__())
#+end_src

#+RESULTS:
: Appending 1 and 3 to empty linked list: 1 3 
: Prepending 0 to existing linked list: 0 1 3 
: Len of singly linked list: 3
: Inserting val=2 to second 'idx': 0 1 2 3 
: Len of singly linked list: 4
: Deleting 1 from linked list: 0 2 3 
: Len of singly linked list: 3

